# FamilyWorkPlaneBased Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FamilyWorkPlaneBased Property
ParameterTypeId Class See Also
---
"Work Plane-Based"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FamilyWorkPlaneBased { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FamilyWorkPlaneBased As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FamilyWorkPlaneBased {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace